org/_posts/2013-11/2013-11-1-python-update.org
#+BEGIN_HTML
---
layout: post
keywords: 
description: 
title: CentOS6.3升级Python到2.7.3版本 
categories: [python]
tags: [python,centos,update]
group: archive
icon: code
featured: false
---
#+END_HTML
* 安装
#+BEGIN_SRC sh
#查看python的版本
python -V
Python 2.6.6

#下载Python-2.7.3
wget http://python.org/ftp/python/2.7.3/Python-2.7.3.tar.bz2

#解压
tar xvjf Python-2.7.3.tar.bz2
cd Python-2.7.3

#安装
./configure
make all
make install
make clean
make distclean

#查看版本信息
/usr/local/bin/python2.7 -V
python 2.7.3
#+END_SRC
* 建立软链接，使系统默认的python指向python2.7
正常情况下即使python2.7安装成功后，系统默认指向的python仍然是2.6.6版本，考虑到yum是基于python2.6.6才能正常工作，不敢轻易卸载。
#+BEGIN_SRC sh
mv /usr/bin/python /usr/bin/python2.6.6
ln -s /usr/local/bin/python2.7 /usr/bin/python
#检验
python -V
python 2.7.3
#+END_SRC
* 解决yum问题
系统python指向python2.7版本后，yum不能正常工作
#+BEGIN_SRC sh
vi /usr/bin/yum
#将文件头部的
#!/usr/bin/python
#改成
#!/usr/bin/python2.6.6
#+END_SRC
* 参考资料
[[http://www.cnblogs.com/balaamwe/p/3296857.html][CentOS6.3升级Python到2.7.3版本]]
